---
kind: type
id: T:Autodesk.Revit.DB.Outline
source: html/1ffe9215-0dd5-358f-495d-e983f9e7d295.htm
---
# Autodesk.Revit.DB.Outline

Outline is a generic object that provides a bounding box/bounding outline. It supports
 operations to scale and transform. It also supports intersections and contains operations.

## Syntax (C#)
```csharp
public class Outline : IDisposable
```